/*
[문제 설명]
 세 점의 좌표 x_1,y_1,x_2,y_2,x_3,y_3가 주어질 때,
 세 점으로 만들 수 있는 삼각형의 넓이에 2를 곱하여 출력하는 함수, solution을 완성해주세요.

[제한 사항]
 - 만약 세 점이 일직선상에 위치하는 경우에는 0을 출력합니다.

[입력 형식]
 - points는 세 점의 x, y좌표가 x_1,y_1,x_2,y_2,x_3,y_3 순서대로 있는 길이가 6인 배열입니다.
 - 각 좌표 값은 -1,000 이상 1,000 이하의 정수입니다.

[출력 형식]
 - 세 점을 연결하여 만들 수 있는 삼각형의 넓이에 2를 곱하여 출력합니다.
*/

function solution(points) {
  let [p1, p2, p3, p4, p5, p6] = [...points];
  return Math.abs(p1 * p4 + p3 * p6 + p5 * p2 - (p3 * p2 + p5 * p4 + p1 * p6));
}

// 점수: 1.0/1.0
