/*
3 x 3개의 격자 형태의 두더지 게임판이 있습니다.
두더지들은 들어가거나 나와 있는데, 이 두더지들을 모두 나오도록 바꾸는 게임입니다.
두더지를 조작하는 유일한 방법은 10개의 스위치를 조작하는 것으로,
각 스위치는 1개 이상의 두더지에 연결되어 있습니다.
한 스위치를 누를 때마다,
해당 스위치와 연결된 나와 있던 두더지는 들어가고, 들어가 있던 두더지는 나옵니다.
이때, 모든 두더지를 나오게 하려면 최소한 스위치를 몇 번이나 눌러야 할지를 출력하는 함수,
solution을 완성해주세요.
예를 들어, 게임판의 9마리 두더지 상태 state로 [ 1, 0, 1, 0, 0, 1, 1, 1, 1 ]가 있고,
10개의 스위치에 연결된 두더지 번호 linkNums가
[ [1], [7], [8], [4, 7], [1, 3], [3, 4, 8], [0], [6], [2], [1, 4] ] 라고 가정할 때,
스위치에 연결된 두더지 정보는 다음과 같습니다.
> 스위치 0에 연결된 두더지 번호 1
> 스위치 1에 연결된 두더지 번호 7
> 스위치 2에 연결된 두더지 번호 8
> 스위치 3에 연결된 두더지 번호 4, 7
> 스위치 4에 연결된 두더지 번호 1, 3
> 스위치 5에 연결된 두더지 번호 3, 4, 8
> 스위치 6에 연결된 두더지 번호 0
> 스위치 7에 연결된 두더지 번호 6
> 스위치 8에 연결된 두더지 번호 2
> 스위치 9에 연결된 두더지 번호 1, 4
이때, 모든 두더지를 나오게 하려면 최소한 3번의 스위치(스위치 0, 2, 5)를 눌러야 합니다.
*/

// 아예 풀지 못함..

// 점수: 0.0/1.0
